Revit 2026 API

# FilterStringRuleSetEvaluator Method

---

Sets the evaluator that implements the test for this rule.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetEvaluator(
	FilterStringRuleEvaluator evaluator
)
```
```vb
Public Sub SetEvaluator (
	evaluator As FilterStringRuleEvaluator
)
```
```cpp
public:
void SetEvaluator(
	FilterStringRuleEvaluator^ evaluator
)
```
```fsharp
member SetEvaluator :
        evaluator : FilterStringRuleEvaluator -> unit
```

#### Parameters

evaluator FilterStringRuleEvaluator

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

FilterStringRule Class

Autodesk.Revit.DB Namespace